Autodesk.Revit.DB.ImportPlacement
Since:
2013
An enumerated type listing possible placement modes for imported drawings.
Since:
2013

Autodesk.Revit.DB.ImportPlacement.Shared
Placement with respect to the shared coordinates.
Revit Building places the imported geometry according to its location
with respect to the shared coordinates between the two files.
There must be shared coordinates in a Revit document in order for this option to be valid.

Autodesk.Revit.DB.ImportPlacement.Centered
Placement at the Center.
If reference point is provided, then the import is placed
so the point is at the model's center. If no point is provided,
then the document's center is matched with the model's origin.

Autodesk.Revit.DB.ImportPlacement.Origin
Placement at the Origin.
If reference point is provided, then the import is placed
so the point is at the model's origin. If no point is provided,
then the document's origin is matched with the model's origin.

Autodesk.Revit.DB.ImportPlacement.Site
Placement at Base Point.  Useful for Revit links only.
There must be a reference point in order for this option to be valid.